Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--geoserver_quickstart.tmx
Source language: en
Languages: ja

source: GeoServer Quickstart
ja: GeoServer クイック スタート

source: GeoServer is a java application for serving maps (and data) for other clients (such as web browsers) to draw. GeoServer comes with a browser-based management interface and connects to multiple data sources at the back end.
ja: GeoServerは、他のクライアント(Webブラウザなど)が描画するマップ(およびデータ)を提供するJavaアプリケーションです。GeoServer は、ブラウザベースの管理インターフェイスを持ち、バックエンド側で複数のデータソースへ接続します。

source: This Quick Start describes how to:
ja: このクイックスタートでは、次の方法について説明します。

source: add a vector and raster data source to GeoServer
ja: GeoServerにベクターとラスターデータソースを追加する

source: apply color to map features using styling
ja: スタイルを使用してマップフィーチャーに色を適用する

source: test the layers in a simple web map
ja: シンプルなWebマップでレイヤーをテストする

source: learn about clients that can display your maps
ja: マップを表示できるクライアントについて学習

source: add a layer from a NetCDF file
ja: NetCDFファイルからレイヤーを追加する

source: Start Geoserver
ja: Geoserverを起動する

source: From the Start menu, select |osgeolive-appmenupath-geoserver|. The application will take a few moments to start up and will open a web page at http://localhost:8082/geoserver/web
ja: スタートメニューから、|osgeolive-appmenupath-geoserver|を選択します。アプリケーションの起動には少し時間がかかり、http://localhost:8082/geoserver/web でWebページが開きます。

source: Log in using the username **admin** and password **geoserver**. You will now see the *admin page*.
ja: ユーザー名**admin**とパスワード**geoserver**を使用してログインします。これで、*admin page*が表示されます。

source: Select the **Layer Preview** link at the top of the *Data* section in the left hand menu to see a preview of the layers that are loaded on the server.
ja: 左側のメニューの *Data*セクションの一番上にある **Layer Preview**リンクをクリックすると、サーバーにロードされているレイヤのプレビューが表示されます。

source: Scroll to the bottom of the page and click on the **OpenLayers** link in the **tiger-ny** row. This will open a new window with a preview of some of the sample data.
ja: ページの下部までスクロールし、**tiger-ny**行の**OpenLayers**リンクをクリックします。これにより、新しいウィンドウが開き、サンプルデータのプレビューが表示されます。

source: You can zoom in to the map in three ways:
ja: マップを拡大するには、次の 3 つの方法があります。

source: by clicking on the zoom bar on the left, the higher you click on it the more zoomed in you will see.
ja: 左側のズームバーをクリックすると、クリックするほど拡大して表示されます。

source: by using the mouse scroll wheel (if you have one), scrolling up will zoom in and down will zoom out.
ja: マウスのスクロールホイールを使用すると(ある場合)、上へスクロールするとズームインし、下へスクロールするとズームアウトします。

source: by dragging a box on the map while holding down the :kbd:`shift key` - this will zoom in to the box selected (or as near as will fit in the screen).
ja: :kbd:`shiftキー`-を押しながらマップ上のボックスをドラッグすると、選択されたボックスにズームします(または画面に収まる程度にズームします)。

source: Experiment with this view and look at some of the other previews. Once you are comfortable viewing existing data you can move on to adding some new data.
ja: このビューを試して、他のプレビューをいくつか見てみましょう。既存のデータを見やすくなったら、新しいデータを追加することができます。

source: Loading data
ja: データをロード

source: You will not be able to carry out the following steps if you are running with a **read only** file system (such as the DVD). You will either need to run in a Virtual Machine, or from a USB, or install OSGeoLive (or just GeoServer) onto your hard drive.
ja: **読み取り専用**ファイルシステム(DVDなど)を使用している場合は、次の手順を実行できません。仮想マシンまたはUSBから実行するか、OSGeoLive(または単にGeoServer)をハードドライブにインストールする必要があります。

source: In this example we are going to use the :doc:`Natural Earth data set <../overview/naturalearth_overview>` that is included on OSGeoLive (:file:`/usr/local/share/data/natural_earth2/`).
ja: この例では、OSGeoLiveに含まれている:doc:`Natural Earthデータセット<./overview/naturalearth_overview>`(:file:`/usr/local/share/data/natural_earth2/`)を使用します。

source: We need to create a Store for our data. From the |GS| admin page go to :guilabel:`Stores`.
ja: データ用のストアを作成する必要があります。|GS| 管理ページから:guilabel:`Stores`に移動します。

source: Click on :guilabel:`Add new Store`. You will see this page:
ja: :guilabel:`Add new Store`をクリックします。次のページが表示されます。

source: Select the :guilabel:`Directory of spatial files`. You will see the following:
ja: :guilabel:`Directory of spatial files`を選択します。次のように表示されます。

source: Type in a name for the Data Store (for example, *Natural Earth*) and fill in the URL to the data set - in this case :file:`/usr/local/share/data/natural_earth2/`. You can use the browse button to find the directory if your data is somewhere else.
ja: データストアの名前(*Natural Earth*など)を入力し、データセットのURL(この場合は:file:`/usr/local/share/data/natural_earth2/`)を入力します。データが他の場所にある場合は、ブラウズボタンを使用してディレクトリを検索できます。

source: Press :guilabel:`save`.
ja: :guilabel:`保存`を押します。

source: Press :guilabel:`publish` next to one of the layers to finish adding the data. This will take you to the *Layers* page:
ja: いずれかのレイヤーの横にある:guilabel:`公開`を押して、データの追加を完了します。これにより、*レイヤ*ページに移動します。

source: As you scroll down the page you will see that |GS| has filled in many of the fields for you. When you reach :guilabel:`Coordinate Reference System` you will notice that under *Native SRS* it says UNKNOWN you will need to fill in the next box (*declared SRS*) to make sure |GS| knows where the data is.
ja: ページをスクロールすると、|GS| が多くのフィールドにデータ挿入していることがわかります。:guilabel:`Coordinate Reference System`に到達すると、*Native SRS*の下にUNKNOWNと表示されていることがわかります。次のボックス(*declared SRS*)に入力して、|GS| がデータの場所を確実に認識できるようにする必要があります。

source: You can type epsg:4326 in the box, or go to `http://prj2epsg.org/search <http://prj2epsg.org/search>`_ and paste in the string you see if you click on the link next to "UNKNOWN".
ja: ボックスにepsg:4326と入力するか、 `http://prj2epsg.org/search <http://prj2epsg.org/search>`_ に移動して、次のリンクをクリックすると表示される文字列を貼り付けます 「不明」に。

source: Click on :guilabel:`Compute from data` and :guilabel:`Compute from native bounds` to fill in the Bounding Boxes.
ja: :guilabel:`Compute from data`と:guilabel:`Compute from native bounds`をクリックして、境界ボックス内のデータ表示します。

source: Finally hit :guilabel:`save` and you have published your first layer.
ja: 最後に:guilabel:`保存`をクリックて、最初のレイヤを公開しました。

source: Don't worry if the layer preview doesn't look very good as it is using the default style. In the next section we will look at producing a nicer style.
ja: レイヤのプレビューは既定のスタイルを使用しているため、あまり見栄えがしなくても心配ありません。次のセクションでは、より良いスタイルの作成について説明します。

source: You can follow the same step with the other layers in the directory by using the :guilabel:`Add a new resource` button on the layers page. Just select the natural earth store from the drop down box to get back to the store's page.
ja: ディレクトリ内の他のレイヤーについても、レイヤーページの:guilabel:`Add a new resource`ボタンを使用して同じ手順を実行できます。ドロップダウンボックスからNatural Earthストアを選択するだけで、ストアのページに戻ります。

source: Styling data
ja: データをスタイリング

source: Styling a data set into a map layer |GS| uses an OGC standard called |SLD|. These are represented as XML files which describe the rules that are used to apply various symbolizers to the data.
ja: マップレイヤへのデータセットのスタイリングにおいて、 |GS| は |SLD| と呼ばれるOGC標準を使用しています。これらは、データにさまざまな図案化を適用するために使用されるルールを記述するXMLファイルとして表されます。

source: To get started, lets style the Land and Ocean datasets. You can create SLD files using a simple text editor, but sometimes a graphical editor is better. There are several options here but |UG| allows you to open the shapefiles directly and apply simple styles using a GUI. It also provides a simple editor to modify the XML if I need to.
ja: はじめに、で陸地と海洋のデータセットのスタイルを設定しましょう。SLDファイルは簡単なテキストエディタで作成できますが、グラフィカルエディタの方がよい場合もあります。ここにはいくつかのオプションがありますが、|UG| ではシェイプファイルを直接開き、GUIを使用して簡単なスタイルを適用できます。また、必要に応じてXMLを変更するための簡単なエディタも提供しています。

source: Using |UG| to create simple styles
ja: |UG| を使用したシンプルなスタイルの作成

source: For more details on how to use |UG| see the :doc:`uDig Quickstart <../quickstart/udig_quickstart>`
ja: |UG| の使用方法に関するその他の詳細については、:doc:`uDigクイックスタート<./quickstart/udig_quickstart>`を参照してください。

source: Open |UG| and add the shapefiles (using the add data button in the top left hand corner).
ja: |UG| を開き、シェイプファイルを追加します(左上隅のデータ追加ボタンを使用)。

source: Drag the ne_10m_land and ne_10m_ocean tables into the map window. |UG| automatically applies a style (so you can see the data).
ja: ne_10m_landテーブルとne_10m_oceanテーブルをマップウィンドウにドラッグします。|UG| は自動的にスタイルを適用します(データが見えるようになります)。

source: In the :ref:`Layer list <Layer_list>` select the style button (it looks like an artist's palette).
ja: :ref:`レイヤリスト<Layer_list>`でスタイルボタン(アーティストのパレットのように見えます)を選択します。

source: This will open the :ref:`Style Pane <Style_Pane>`.
ja: これにより、:ref:`スタイルペイン<Style_Pane>`が開きます。

source: In the simple window we can easily select a nice blue for the oceans by clicking on the colored box on the fill tab and choosing from the color picker it produces. We can also increase the opacity of the fill to 100% to make the color look better. Pick the same blue for the border color so it will match.
ja: シンプルなウィンドウでは、塗りつぶしタブの色付きのボックスをクリックし、表示されるカラーピッカーから選択することで、海洋に適した青を簡単に選択できます。また、塗りつぶしの不透明度を100%に上げて、カラーの見栄えを良くすることもできます。境界線の色に同じ青を選択して、一致させます。

source: Click ``OK`` and |UG| will display the changes.
ja: ``OK``をクリックすると、|UG| が変更を表示します。

source: Repeat the steps above to change the color of the land layer. You can use the ``define custom colors`` section to create your preferred color.
ja: 上記の手順を繰り返して、土地のレイヤの色を変更します。``define custom colors``セクションを使用して、好みの色を作成できます。

source: This gives a nice looking basic world map.
ja: これにより、美しい外観の基本的な世界マップが得られます。

source: Adding the style to GeoServer
ja: GeoServerへのスタイルの追加

source: Now we need to transfer these styles to |GS|.
ja: 次に、これらのスタイルを |GS| に転送する必要があります。

source: On the style window there is an export button which allows you to save the SLD file that defines your style.
ja: スタイルウィンドウにはエクスポートボタンがあり、スタイルを定義するSLDファイルを保存できます。

source: Once saved, you can go to the |GS| admin page again and select ``Styles`` (at the bottom of the ``Data`` section).
ja: 保存後、再度 |GS| 管理ページに移動して、``Styles``(``Data``セクションの下部)を選択できます。

source: Select the ``Add New Style`` link. At the bottom of that page is a file upload box and a browse button.
ja: ``新規スタイル追加``リンクを選択します。このページの下部には、ファイルアップロードボックスと参照ボタンがあります。

source: Clicking browse to find the files you just saved.
ja: [参照ボタン] をクリックして、保存したファイルを検索します。

source: Click the upload link (next to the browse button) and a copy of the file appears in the editor.
ja: アップロードリンク(参照ボタンの横)をクリックすると、ファイルの内容がエディタに表示されます。

source: If you click on the validate button the highlighted lines will give you an error but you can safely ignore the error (or delete those lines as they don't do anything).
ja: 妥当性検査ボタンをクリックすると、強調表示されたラインにエラーが表示されますが、エラーを無視しても安全です(または、何もしないラインを削除してもかまいません)。

source: Press the :guilabel:`Submit` at the bottom of the page.
ja: ページの下部にある:guilabel:`Submit`を押します。

source: Adding the style to the layer
ja: レイヤにスタイルを追加

source: Click on the :guilabel:`Layers` link in the Menu on the left of the |GS| window.
ja: |GS| ウィンドウの左側にあるメニューの:guilabel:`レイヤ`リンクをクリックします。

source: Click on the layer (e.g. *ne_10m_land*), then select the :guilabel:`Publishing` tab.
ja: レイヤ(例:*ne_10m_land*)をクリックし、:guilabel:`Publishing`タブを選択します。

source: Change the :guilabel:`Default Style` box to the name of the style you uploaded in the previous section.
ja: :guilabel:`Default Style`ボックスを前のセクションでアップロードしたスタイルの名前に変更します。

source: Now click :guilabel:`Save` and go to the Layer Preview page to check that it looks good.
ja: 次に、:guilabel:`保存`をクリックし、レイヤプレビューページに移動して、外観が良いことを確認します。

source: There are example style files for all of the example Natural Earth layers in :file:`/usr/local/share/geoserver`.
ja: :file:`/usr/local/share/geoserver`には、すべてのNatural Earthサンプルレイヤのサンプルスタイルファイルがあります。

source: Clients for WMS layers
ja: WMSレイヤーのクライアント

source: The |WMS| layers you are serving from |GS| can be used with a variety of clients on this OSGeoLive distribution, including:
ja: |GS| から提供されているWMSレイヤは、このOSGeoLiveディストリビューションのさまざまなクライアントで使用できます。次のものがあります。

source: Add a layer from a NetCDF file
ja: NetCDFファイルからレイヤを追加する

source: The GeoServer NetCDF plugin allows the publication of rasters from NetCDF files.
ja: GeoServer NetCDFプラグインを使用すると、NetCDFファイルからラスターを発行できます。

source: Configure a NetCDF store
ja: NetCDFストアを設定

source: After running "Start GeoServer"
ja: "GeoServerの開始"の実行後

source: Login as the administrator.
ja: 管理者としてログインします。

source: Click on :guilabel:`Add stores` then :guilabel:`NetCDF`.
ja: :guilabel:`ストア追加`をクリックし、次に:guilabel:`NetCDF`をクリックします。

source: Enter a value for Data Source Name (this example uses "netcdf") and a NetCDF URL. You can use this sample file::
ja: [Data Source Name]の値(今回は「netcdf」)と、NetCDF URLを入力します。次のサンプルファイルを利用可能::

source: Press "Save", "Publish" the "O3" layer.
ja: "保存"と"O3"レイヤを"公開" を押してください。

source: Scroll down to the bottom of the "Data" tab and press "Save" again.
ja: "Data"タブの一番下までスクロールダウンし、もう一度"保存"を押します。

source: Preview the NetCDF layer
ja: NetCDFレイヤをプレビュー

source: Select "Layer Preview" from the menu on the left
ja: 左側のメニューから"レイヤプレビュー"を選択

source: Scroll down to find the "cite:O3" entry, and click on the "OpenLayers" link to show a preview of the layer.
ja: 下へスクロールして"cite: O3"の項目を探し、"OpenLayers"リンクをクリックしてレイヤのプレビューを表示します。

source: Clicking on points will cause the value of "Ozone_concentration" to be shown in a table at the bottom of the map.
ja: 点をクリックすると、「オゾン濃度」の値がマップの下部のテーブルに表示されます。

source: This GeoServer instance has been configured with the ``NETCDF_DATA_DIR`` Java system property to allow the publication of NetCDF files in read-only directories.
ja: このGeoServerインスタンスは、``NETCDF_DATA_DIR``Javaシステムプロパティを使用して設定されており、読み取り専用ディレクトリにNetCDFファイルを公開できます。

source: What next?
ja: 次のステップ

source: This is only the first step on the road to using GeoServer. There is a lot more functionality you can try.
ja: これは、GeoServerを使用するための最初のステップにすぎません。他にも多くの機能を試すことができます。

source: GeoServer Project home - http://geoserver.org/
ja: GeoServer プロジェクト ホーム - http://geoserver.org/

source: GeoServer User Manual - https://docs.geoserver.org/latest/en/user/
ja: GeoServer ユーザーマニュアル - https://docs.geoserver.org/latest/en/user/

source: GeoServer Tutorials - https://docs.geoserver.org/latest/en/user/tutorials/index.html
ja: GeoServer チュートリアル - https://docs.geoserver.org/latest/en/user/tutorials/index.html

source: GeoServer Styling Workshop - https://docs.geoserver.org/latest/en/user/styling/workshop/index.html
ja: GeoServer スタイリングワークショップ - https://docs.geoserver.org/latest/en/user/styling/workshop/index.html
